src/cf/InformationRegisters/инт_КэшированиеСхемOpenApi.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>инт_КэшированиеСхемOpenApi</Name>
			<Comment>Регистр предназначен для хранения информации о времени последнего обновления схемы api из внешнего источника.</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаОбновления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СсылкаНаСхему</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.инт_Схемы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/инт_КэшированиеСхемOpenApi/Ext/ManagerModule.bsl
////////////////////////////////////////////////////////////////////////////////
// инт_КэшированиеСхемOpenApi
//  
////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция - необходимо ли выполнить обновление кэша схемы данных
//
// Параметры:
//  Схема     - СправочникСсылка.инт_Схемы - Ссылка на схему данных
// 
// Возвращаемое значение:
//  Булево - Истина, если данные кэша нужно обновить.
//
Функция ТребуетсяОбновление(СсылкаНаСхему) Экспорт
Запрос = Новый запрос;
Запрос.Текст = "ВЫБРАТЬ
               |    инт_КэшированиеСхемOpenApi.СсылкаНаСхему КАК СсылкаНаСхему
               |ИЗ
               |    РегистрСведений.инт_КэшированиеСхемOpenApi КАК инт_КэшированиеСхемOpenApi
               |ГДЕ
               |    инт_КэшированиеСхемOpenApi.СсылкаНаСхему = &СсылкаНаСхему
               |    И инт_КэшированиеСхемOpenApi.ДатаОбновления > &ТекущийМомент";
Запрос.УстановитьПараметр("ТекущийМомент", инт_ОбщегоНазначения.ВремяБазы());
Запрос.УстановитьПараметр("СсылкаНаСхему", СсылкаНаСхему);

Возврат Запрос.Выполнить().Пустой();
КонецФункции
 
// Процедура - Обновить дату кэша прибавляя день к текущей дате.
//
// Параметры:
//  Схема     - СправочникСсылка.инт_Схемы - Ссылка на схему данных 
//
Процедура ОбновитьДатуКэша(Схема) Экспорт
		Запись = РегистрыСведений.инт_КэшированиеСхемOpenApi.СоздатьМенеджерЗаписи();
        День = 38600;
        Запись.ДатаОбновления = инт_ОбщегоНазначения.ВремяБазы()+День;
        Запись.СсылкаНаСхему = Схема;
        Запись.Записать(Истина);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли
